name: "postprocessor"
backend: "python"

input [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 1, 5 ]
  }
]
output [
  {
    name: "RESULT0"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  }
]
instance_group [{ kind: KIND_CPU }]
