name: "ensemble_pipeline"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "x0"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "x1"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "x2"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "x3"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "v2000"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
output [
  {
    name: "ANOMALY_SCORE0"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
output [
  {
    name: "ANOMALY0"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessor"
      model_version: -1
      input_map{
          key: "x0"
          value: "x0"
      }
      input_map{
          key: "x1"
          value: "x1"
      }
      input_map{
          key: "x2"
          value: "x2"
      }
      input_map{
          key: "x3"
          value: "x3"
      }
      input_map{
          key: "v2000"
          value: "v2000"
      }
      output_map {
        key: "INPUT0"
        value: "preprocess_out"
      }
    },
    {
      model_name: "tf_autoencoder_fp32"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "preprocess_out"
      }
      output_map {
        key: "OUTPUT0"
        value: "autoencoder_output"
      }
    },
    {
      model_name: "postprocessor"
      model_version: -1
      input_map {
        key: "RECONSTR0"
        value: "autoencoder_output"
      }
      input_map {
        key: "ORIG0"
        value: "preprocess_out"
      }
      output_map {
        key: "ANOMALY_SCORE0"
        value: "ANOMALY_SCORE0"
      }
      output_map {
        key: "ANOMALY0"
        value: "ANOMALY0"
      }
    }
  ]
}
